import { isPlatformBrowser, NgClass } from '@angular/common';
import { Component, CUSTOM_ELEMENTS_SCHEMA, inject, OnInit, PLATFORM_ID } from '@angular/core';
import { TranslatePipe } from '@ngx-translate/core';
import { SwiperOptions } from 'swiper/types';

@Component({
  selector: 'app-partners',
  standalone: true,
  imports: [TranslatePipe, NgClass],
  templateUrl: './partners.component.html',
  styleUrl: './partners.component.scss',
  schemas:[CUSTOM_ELEMENTS_SCHEMA]
})
export class PartnersComponent implements OnInit{
  partners = [
    {
      Image:'assets/image/parteners-image/a1.png',
      title: "الشريك والمدير العام",
      position: "السيـــــــــــــــــــــــد",
      name: "تركي ناصر الدعجاني",
      headPosition: "مستشار مالي ومحاسب قانوني معتمد يمتلك خبرة تمتد لأكثر من 15 عامًا.",
      positionItems: [
        { item: "حاصل على زمالة الهيئة السعودية للمراجعين والمحاسبين (SOCPA)." },
        { item: "حاصل على درجة ماجستير في المحاسبة من جامعة (HUDDERSFIELD) في المملكة المتحدة." }
      ],
      experiences: [
        {
          title: "المؤهلات العلمية",
          description: "السيد تركي الدعجاني هو محاسب قانوني معتمد وحاصل على درجة الماجستير من جامعة HUDDERSFIELD، بالإضافة إلى البكالوريوس في المحاسبة."
        },
        {
          title: "الخبرة العملية",
          description: "لدى السيد تركي خبرة تمتد لأكثر من خمسة عشر عامًا في مجال مراجعة الحسابات والاستشارات المالية، وتمتد خبرته في الإشراف على أعمال المراجعة والاستشارات المالية لقطاع الأعمال."
        },
        {
          title: "المؤسسات التي أسسها",
          description: "مؤسس مكتب تركي بن ناصر الدعجاني."
        },
        {
          title: "الشراكات",
          description: "مؤسس وشريك في شركة لين للاستشارات المالية والاستشارات المهنية LEAN ADVISORY."
        },
        {
          title: "الاستثمارات التقنية",
          description: "مؤسس وشريك في حلول شركة لين لتقنية المعلومات."
        },
        {
          title: "المراجعة والضرائب",
          description: "يمتلك خبرة طويلة في مراجعة حسابات العديد من الشركات المساهمة والتجارية والمنظمات الحكومية وشبه الحكومية، وكذلك التعامل مع قضايا الزكاة وضريبة الدخل في المملكة العربية السعودية."
        },
        {
          title: "الخبرة السابقة",
          description: "عمل السيد تركي الدعجاني في شركة EY (إرنست أند يانغ)."
        },
        {
          title: "إدارة المخاطر",
          description: "قاد العديد من عمليات تقييم المخاطر والمراجعة الداخلية لعدد من الجهات."
        },
        {
          title: "المراجعات الحكومية والخاصة",
          description: "أشرف على العديد من مراجعة حسابات الهيئات والجهات الحكومية وشركات القطاع الخاص."
        }
      ]
    },
    {
      Image:'assets/image/parteners-image/a2.png',
      title: "الشريك التنفيذي",
      position: "الأستـــــــــــاذ",
      name: "محمد المرسي",
      headPosition: "يمتلك خبرة تمتد لأكثر من 22 عامًا في مجال الاستشارات والمراجعة.",
      positionItems: [
        { item: "حاصل على الدكتوراه في إدارة الأعمال في المحاسبة DBA." },
        { item: "عضو الهيئة السعودية للمحاسبين والمراجعين." },
        { item: "عضو جمعية المحاسبين والمراجعين المصرية." },
        { item: "زميل جمعية المحاسبين القانونيين العربية." },
        { item: "عضو جمعية الضرائب المصرية." },
        { item: "حاصل على بكالوريوس تجارة قسم محاسبة." },
        { item: "حاصل على ماجستير في المراجعة MBA." },
        { item: "حاصل على دبلوم المحاسبة والمراجعة." },
        { item: "حاصل على دورة معايير المراجعة الدولية IFRS." },
        { item: "حاصل على CMA." }
      ],
      experiences: [
        {
          title: "القيادة والإشراف",
          description: "يمتلك الأستاذ محمد المرسي القدرة والمهارات اللازمة لقيادة وتوجيه فرق عمل الاستشارات والمراجعة وتقديم الإرشاد والإشراف لتنفيذ عمليات الاستشارات بما يساعد على التأكد من كفاءة وفاعلية الخدمة المقدمة للعميل بالإضافة إلى توفير الدعم الفني والإداري من خلال تقديم الاستشارات والإرشادات المهنية في ضوء الأنظمة المالية والمعايير الدولية."
        },
        {
          title: "الخبرة في شركات المحاسبة الكبرى",
          description: "عمل لدى عدد من شركات المحاسبة الكبرى وقد قام بأعمال متنوعة في تقديم الاستشارات المالية والإدارية وأيضًا المراجعة سواء للجهات الحكومية ومراجعة الشركات وتقييم الأداء والمشاركة في لجان الحسابات الختامية."
        },
        {
          title: "أكثر من 22 عامًا خبرة",
          description: "لديه خبرة عميقة في أكثر من 22 عامًا في مجال الاستشارات المالية والمحاسبية وشملت خبرته على العديد من المجالات مثل التحليل المالي، الاستشارات الزكاة والضريبة، الحلول التمويلية."
        },
        {
          title: "دراسات الجدوى وحوكمة الشركات",
          description: "عمله في شركات المحاسبة الكبرى أتاح له العمل في المجالات، مثل دراسات الجدوى، تقييم الشركات، حوكمة الشركات، التطوير ووضع الأنظمة المالية والمحاسبية."
        },
        {
          title: "إعادة الهيكلة والتدقيق الداخلي",
          description: "قاد ونفذ العديد من دراسات إعادة الهيكلة، التدقيق الداخلي والضبط الداخلي للمنشآت."
        },
        {
          title: "تطوير الأداء المؤسسي",
          description: "قدم استشارات واسعة في دراسات الكفاءة وتطوير الأداء المؤسسي."
        },
        {
          title: "المساهمات المؤسسية والاستراتيجيات",
          description: "لدى السيد محمد خبرة واسعة في مجال المساهمات المؤسسية وإعداد الاستراتيجيات والتطوير."
        }
      ]
    }
  ];
  showAllExperiences: boolean = false;

  ngOnInit(): void {
    console.log(this.partners[0].experiences[0].title);

  }
  swiperConfig: SwiperOptions = {
    slidesPerView: 9,
    spaceBetween: 20,
    centeredSlides: true,
    loop:true,
    autoplay: {
      delay: 1000,
      disableOnInteraction: false
    },
    breakpoints: {
      1200: {
        slidesPerView: 9,
      },
      768: {
        slidesPerView: 6,
      },
      0: {
        slidesPerView: 3,
      }
    }
  };
}
